# Toy data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://ssciwr.github.io/jupyter-data-exploration/data.csv")

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
len(df)

20

In [5]:
df.head()

     Name  Age     Sex  Height Eye colour Wears glasses
0     Bob   12    Male   130.0       blue           yes
1   Simon   13    Male   120.0       blue            no
2   Clare   15  Female   142.5      green            no
3    Jose   11    Male   117.0      brown            no
4  Hannah    9  Female   111.0       blue           yes

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           20 non-null     object
 1   Age            20 non-null     int64
 2   Sex            20 non-null     object
 3   Height         20 non-null     float64
 4   Eye colour     20 non-null     object
 5   Wears glasses  20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [8]:
names = df["Name"]

In [9]:
type(names)

pandas.core.series.Series

In [10]:
names.head()

0       Bob
1     Simon
2     Clare
3      Jose
4    Hannah
Name: Name, dtype: object

In [11]:
names[0]

'Bob'

In [12]:
names[0:3]

0      Bob
1    Simon
2    Clare
Name: Name, dtype: object

In [13]:
for name in names:
    print(name)

Bob
Simon
Clare
Jose
Hannah
Ryan
Craig
Suzy
Chris
Josie
Claire
John
Agnes
Robert
Julia
Fabian
Joseph
Roberta
Chris
Lucas

In [14]:
ages = df.Age

In [15]:
ages.head()

0    12
1    13
2    15
3    11
4     9
Name: Age, dtype: int64

In [16]:
df.iloc[0]

Name               Bob
Age                 12
Sex               Male
Height           130.0
Eye colour        blue
Wears glasses      yes
Name: 0, dtype: object

In [17]:
df.iloc[0,:]

Name               Bob
Age                 12
Sex               Male
Height           130.0
Eye colour        blue
Wears glasses      yes
Name: 0, dtype: object

In [19]:
# first column:
df.iloc[:,0]

0         Bob
1       Simon
2       Clare
3        Jose
4      Hannah
5        Ryan
6       Craig
7        Suzy
8       Chris
9       Josie
10     Claire
11       John
12      Agnes
13     Robert
14      Julia
15     Fabian
16     Joseph
17    Roberta
18      Chris
19      Lucas
Name: Name, dtype: object

In [20]:
df.iloc[2:5,0:2]

     Name  Age
2   Clare   15
3    Jose   11
4  Hannah    9

In [21]:
df.iloc[[2,3,4],[0,4]]

     Name Eye colour
2   Clare      green
3    Jose      brown
4  Hannah       blue

In [22]:
df.loc[0]

Name               Bob
Age                 12
Sex               Male
Height           130.0
Eye colour        blue
Wears glasses      yes
Name: 0, dtype: object

In [23]:
df.loc[0,:]

Name               Bob
Age                 12
Sex               Male
Height           130.0
Eye colour        blue
Wears glasses      yes
Name: 0, dtype: object

In [24]:
df.loc[:,"Name"]

0         Bob
1       Simon
2       Clare
3        Jose
4      Hannah
5        Ryan
6       Craig
7        Suzy
8       Chris
9       Josie
10     Claire
11       John
12      Agnes
13     Robert
14      Julia
15     Fabian
16     Joseph
17    Roberta
18      Chris
19      Lucas
Name: Name, dtype: object

In [25]:
df.loc[[0,1,3], ["Name", "Age"]]

    Name  Age
0    Bob   12
1  Simon   13
3   Jose   11